; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	infrared0 - mode
	infrared3 - mode
	spectrograph2 - mode
	image1 - mode
	GroundStation0 - direction
	Star4 - direction
	Star6 - direction
	Star3 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star6)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument2 infrared3)
	(supports instrument2 image1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 infrared3)
	(supports instrument3 spectrograph2)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 spectrograph2)
	(supports instrument4 infrared3)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument5 infrared0)
	(supports instrument5 infrared3)
	(supports instrument5 image1)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 image1)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
	(supports instrument7 spectrograph2)
	(supports instrument7 infrared0)
	(supports instrument7 infrared3)
	(calibration_target instrument7 GroundStation5)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
)
(:goal (and
	(have_image Planet7 image1)
	(have_image Planet8 spectrograph2)
	(have_image Planet9 image1)
	(have_image Phenomenon10 spectrograph2)
	(have_image Phenomenon11 spectrograph2)
	(have_image Planet12 image1)
	(have_image Phenomenon13 infrared0)
))

)

; plan
1. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 7
2. (calibrate satellite2 instrument6 groundstation2)
   added: (calibrated instrument6)
   goals met: 0 of 7
3. (turn_to satellite2 planet12 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet12)
   goals met: 0 of 7
4. (take_image satellite2 planet12 instrument6 image1)
   added: (have_image planet12 image1)
   goals met: 1 of 7
5. (turn_to satellite2 phenomenon11 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 phenomenon11)
   goals met: 1 of 7
6. (take_image satellite2 phenomenon11 instrument6 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 2 of 7
7. (turn_to satellite2 phenomenon10 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 phenomenon10)
   goals met: 2 of 7
8. (take_image satellite2 phenomenon10 instrument6 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 3 of 7
9. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 3 of 7
10. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 3 of 7
11. (turn_to satellite1 phenomenon13 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon13)
   goals met: 3 of 7
12. (take_image satellite1 phenomenon13 instrument2 infrared0)
   added: (have_image phenomenon13 infrared0)
   goals met: 4 of 7
13. (turn_to satellite1 planet7 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet7)
   goals met: 4 of 7
14. (take_image satellite1 planet7 instrument2 image1)
   added: (have_image planet7 image1)
   goals met: 5 of 7
15. (turn_to satellite1 planet9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet9)
   goals met: 5 of 7
16. (take_image satellite1 planet9 instrument2 image1)
   added: (have_image planet9 image1)
   goals met: 6 of 7
17. (turn_to satellite2 planet8 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 planet8)
   goals met: 6 of 7
18. (take_image satellite2 planet8 instrument6 spectrograph2)
   added: (have_image planet8 spectrograph2)
   goals met: 7 of 7
